cf_billing/Reports/бестОтчетПоГВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бестОтчетПоГВС</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf_billing/InformationRegisters/энргФормыУправленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФормыУправленияМКД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормаУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФормыУправленияМКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетОбъемовВыполняетУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначениеПлощадейМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначениеПлощадейМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргОбъемНачисленийМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргОбъемНачисленийМКД</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиНорматив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПредоставлены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПредоставленыПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязанаКШкале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СниматьНачисленныйСредний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьМОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьАбонентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьСобственнаяПоставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаТочку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргНазначениеПУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьУзлаПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияНормативовПотребления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияНормативовПотребления</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючНорматива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Reports/бестОтчетПоГВС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьОтчет(ТабДок, ПараметрыОтчета) Экспорт
	
	ТабДок.Очистить();
	
	Макет	= Отчеты.бестОтчетПоГВС.ПолучитьМакет("Макет");
	
	
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьШапка			= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьУК				= Макет.ПолучитьОбласть("ОбластьУК");
	ОбластьМКД				= Макет.ПолучитьОбласть("ОбластьМКД");
	ОбластьДетали			= Макет.ПолучитьОбласть("ОбластьДетали");
	ОбластьИтогоМКД			= Макет.ПолучитьОбласть("ОбластьИтогоМКД");
	ОбластьИтогоМКДЖилые	= Макет.ПолучитьОбласть("ОбластьИтогоМКДЖилые");
	ОбластьИтогоМКДНежилые	= Макет.ПолучитьОбласть("ОбластьИтогоМКДНежилые");
	ОбластьИтогоУК			= Макет.ПолучитьОбласть("ОбластьИтогоУК");
	ОбластьИтогоУКЖилые		= Макет.ПолучитьОбласть("ОбластьИтогоУКЖилые");
	ОбластьИтогоУКНежилые	= Макет.ПолучитьОбласть("ОбластьИтогоУКНежилые");
	ОбластьИтого			= Макет.ПолучитьОбласть("ОбластьИтого");
	ОбластьИтогоЖилые		= Макет.ПолучитьОбласть("ОбластьИтогоЖилые");
	ОбластьИтогоНежилые		= Макет.ПолучитьОбласть("ОбластьИтогоНежилые");
	
	ОбластьЗаголовок.Параметры.Организация = ПараметрыОтчета.Организация;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 		ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", 		ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 		КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("ГВС_ТН", 			Справочники.энргВидыУслуг.НайтиПоКоду("000000053"));
	Запрос.УстановитьПараметр("ГВС_ТЭ", 			Справочники.энргВидыУслуг.НайтиПоКоду("000000051"));
	Запрос.УстановитьПараметр("ВидНачисления", 		Перечисления.энргВидыНачислений.Начисление);
	Запрос.УстановитьПараметр("ПоНормативу", 		Перечисления.энргСпособНачислений.ПоНормативу);
	Запрос.УстановитьПараметр("ПоСреднему", 		Перечисления.энргСпособНачислений.НачислениеПоСреднему);
	Запрос.УстановитьПараметр("ПоПриборам", 		Перечисления.энргСпособНачислений.ПоПриборам);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргФормыУправленияМКДСрезПоследних.Организация КАК Организация,
	               |	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД,
	               |	энргФормыУправленияМКДСрезПоследних.УК КАК УК,
	               |	энргЗначениеПлощадейМКДСрезПоследних.Площадь КАК ПлощадьМКД,
	               |	энргФормыУправленияМКДСрезПоследних.МКД.Улица + "", д. "" + энргФормыУправленияМКДСрезПоследних.МКД.Дом КАК МКДУлица,
	               |	энргФормыУправленияМКДСрезПоследних.МКД.Дом КАК МКДДом
	               |ПОМЕСТИТЬ ВТ_МКД
	               |ИЗ
	               |	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(&КонецПериода, Организация = &Организация) КАК энргФормыУправленияМКДСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
	               |				&КонецПериода,
	               |				Организация = &Организация
	               |					И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД)) КАК энргЗначениеПлощадейМКДСрезПоследних
	               |		ПО энргФормыУправленияМКДСрезПоследних.МКД = энргЗначениеПлощадейМКДСрезПоследних.МКД
	               |ГДЕ
	               |	энргФормыУправленияМКДСрезПоследних.ФормаУправления = ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.УК)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргОбъемНачислений.Организация КАК Организация,
	               |	энргОбъемНачислений.Район КАК Район,
	               |	энргОбъемНачислений.Строение КАК МКД,
	               |	энргОбъемНачислений.Абонент КАК Абонент,
	               |	энргОбъемНачислений.Шкала КАК Шкала,
	               |	1 КАК Приоритет,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.СпособНачисления = &ПоНормативу
	               |					И энргОбъемНачислений.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА энргОбъемНачислений.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(энргОбъемНачислений.ОбъемУслуги / энргОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ энргОбъемНачислений.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ОбъемПоНормативу,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.СпособНачисления = &ПоСреднему
	               |					И энргОбъемНачислений.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА энргОбъемНачислений.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(энргОбъемНачислений.ОбъемУслуги / энргОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ энргОбъемНачислений.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ОбъемПоСреднему,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.СпособНачисления = &ПоПриборам
	               |					И энргОбъемНачислений.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА энргОбъемНачислений.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(энргОбъемНачислений.ОбъемУслуги / энргОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ энргОбъемНачислений.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ОбъемПоСПриборам,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА энргОбъемНачислений.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(энргОбъемНачислений.ОбъемУслуги / энргОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ энргОбъемНачислений.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ОбъемТН,
	               |	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	               |	МИНИМУМ(энргОбъемНачислений.НачальныеПоказания) КАК НачальныеПоказания,
	               |	МАКСИМУМ(энргОбъемНачислений.КонечныеПоказания) КАК КонечныеПоказания,
	               |	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	               |	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	               |	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	               |	энргОбъемНачислений.Абонент.УдалитьКвартира КАК Квартира,
	               |	энргОбъемНачислений.Абонент.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.Услуга = &ГВС_ТН
	               |				ТОГДА энргОбъемНачислений.ЗначениеТарифа
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ТарифТН,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА энргОбъемНачислений.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(энргОбъемНачислений.Сумма / энргОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ энргОбъемНачислений.Сумма
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаТН,
	               |	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	               |	СУММА(энргОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги,
	               |	СУММА(энргОбъемНачислений.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ_ОбъемНачислений_ТН
	               |ИЗ
	               |	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	               |ГДЕ
	               |	энргОбъемНачислений.Услуга = &ГВС_ТН
	               |	И энргОбъемНачислений.ВидНачисления = &ВидНачисления
	               |	И энргОбъемНачислений.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргОбъемНачислений.Организация,
	               |	энргОбъемНачислений.Район,
	               |	энргОбъемНачислений.Строение,
	               |	энргОбъемНачислений.Шкала,
	               |	энргОбъемНачислений.Абонент,
	               |	энргОбъемНачислений.ПриборУчета,
	               |	энргОбъемНачислений.КоличествоПрописанных,
	               |	энргОбъемНачислений.ЗначениеПлощади,
	               |	энргОбъемНачислений.НормаПотребления,
	               |	энргОбъемНачислений.Абонент.УдалитьКвартира,
	               |	энргОбъемНачислений.Абонент.ЛицевойСчет,
	               |	энргОбъемНачислений.ПовыщающийКоэффициент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бестОбъемНачисленийНП.Организация,
	               |	бестОбъемНачисленийНП.Район,
	               |	бестОбъемНачисленийНП.МКД,
	               |	бестОбъемНачисленийНП.ОбъектРасчета,
	               |	бестОбъемНачисленийНП.Шкала,
	               |	2,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестОбъемНачисленийНП.СпособНачисления = &ПоНормативу
	               |					И бестОбъемНачисленийНП.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА бестОбъемНачисленийНП.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(бестОбъемНачисленийНП.ОбъемУслуги / бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ бестОбъемНачисленийНП.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА бестОбъемНачисленийНП.СпособНачисления = &ПоСреднему
	               |					И бестОбъемНачисленийНП.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА бестОбъемНачисленийНП.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(бестОбъемНачисленийНП.ОбъемУслуги / бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ бестОбъемНачисленийНП.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА бестОбъемНачисленийНП.СпособНачисления = &ПоПриборам
	               |					И бестОбъемНачисленийНП.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА бестОбъемНачисленийНП.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(бестОбъемНачисленийНП.ОбъемУслуги / бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ бестОбъемНачисленийНП.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА бестОбъемНачисленийНП.Услуга = &ГВС_ТН
	               |				ТОГДА ВЫБОР
	               |						КОГДА бестОбъемНачисленийНП.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(бестОбъемНачисленийНП.ОбъемУслуги / бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ бестОбъемНачисленийНП.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	бестОбъемНачисленийНП.ПриборУчета,
	               |	МИНИМУМ(бестОбъемНачисленийНП.НачальныеПоказания),
	               |	МАКСИМУМ(бестОбъемНачисленийНП.КонечныеПоказания),
	               |	NULL,
	               |	бестОбъемНачисленийНП.ЗначениеПлощади,
	               |	бестОбъемНачисленийНП.НормаПотребления,
	               |	""нежилое"",
	               |	бестОбъемНачисленийНП.Договор.Номер,
	               |	NULL,
	               |	NULL,
	               |	бестОбъемНачисленийНП.ПовыщающийКоэффициент,
	               |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги),
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	               |ГДЕ
	               |	бестОбъемНачисленийНП.Услуга = &ГВС_ТЭ
	               |	И бестОбъемНачисленийНП.ВидНачисления = &ВидНачисления
	               |	И бестОбъемНачисленийНП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестОбъемНачисленийНП.Организация,
	               |	бестОбъемНачисленийНП.Район,
	               |	бестОбъемНачисленийНП.МКД,
	               |	бестОбъемНачисленийНП.ОбъектРасчета,
	               |	бестОбъемНачисленийНП.Шкала,
	               |	бестОбъемНачисленийНП.ПриборУчета,
	               |	бестОбъемНачисленийНП.НормаПотребления,
	               |	бестОбъемНачисленийНП.ЗначениеПлощади,
	               |	бестОбъемНачисленийНП.Договор.Номер,
	               |	бестОбъемНачисленийНП.ПовыщающийКоэффициент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргОбъемНачислений.Организация КАК Организация,
	               |	энргОбъемНачислений.Район КАК Район,
	               |	энргОбъемНачислений.Строение КАК МКД,
	               |	энргОбъемНачислений.Абонент КАК Абонент,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.Услуга = &ГВС_ТЭ
	               |				ТОГДА энргОбъемНачислений.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаТЭ,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.Услуга = &ГВС_ТЭ
	               |				ТОГДА энргОбъемНачислений.ЗначениеТарифа
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ТарифТЭ,
	               |	СУММА(ВЫБОР
	               |			КОГДА энргОбъемНачислений.Услуга = &ГВС_ТЭ
	               |				ТОГДА ВЫБОР
	               |						КОГДА энргОбъемНачислений.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(энргОбъемНачислений.ОбъемУслуги / энргОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ энргОбъемНачислений.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ОбъемТЭ,
	               |	энргОбъемНачислений.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ВТ_ОбъемНачислений_ТЭ
	               |ИЗ
	               |	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	               |ГДЕ
	               |	энргОбъемНачислений.Услуга = &ГВС_ТЭ
	               |	И энргОбъемНачислений.ВидНачисления = &ВидНачисления
	               |	И энргОбъемНачислений.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргОбъемНачислений.Организация,
	               |	энргОбъемНачислений.Район,
	               |	энргОбъемНачислений.Строение,
	               |	энргОбъемНачислений.Абонент,
	               |	энргОбъемНачислений.ПриборУчета
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бестОбъемНачисленийНП.Организация,
	               |	бестОбъемНачисленийНП.Район,
	               |	бестОбъемНачисленийНП.МКД,
	               |	бестОбъемНачисленийНП.ОбъектРасчета,
	               |	NULL,
	               |	NULL,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестОбъемНачисленийНП.Услуга = &ГВС_ТЭ
	               |				ТОГДА ВЫБОР
	               |						КОГДА бестОбъемНачисленийНП.ПовыщающийКоэффициент > 1
	               |							ТОГДА ВЫРАЗИТЬ(бестОбъемНачисленийНП.ОбъемУслуги / бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ЧИСЛО(15, 2))
	               |						ИНАЧЕ бестОбъемНачисленийНП.ОбъемУслуги
	               |					КОНЕЦ
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	бестОбъемНачисленийНП.ПриборУчета
	               |ИЗ
	               |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	               |ГДЕ
	               |	бестОбъемНачисленийНП.Услуга = &ГВС_ТЭ
	               |	И бестОбъемНачисленийНП.ВидНачисления = &ВидНачисления
	               |	И бестОбъемНачисленийНП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестОбъемНачисленийНП.Организация,
	               |	бестОбъемНачисленийНП.Район,
	               |	бестОбъемНачисленийНП.МКД,
	               |	бестОбъемНачисленийНП.ОбъектРасчета,
	               |	бестОбъемНачисленийНП.ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОбъемНачислений_ТН.Организация КАК Организация,
	               |	ВТ_ОбъемНачислений_ТН.Район КАК Район,
	               |	ВТ_ОбъемНачислений_ТН.МКД КАК МКД,
	               |	ВТ_ОбъемНачислений_ТН.Абонент КАК Абонент,
	               |	ВТ_ОбъемНачислений_ТЭ.СуммаТЭ КАК СуммаТЭ,
	               |	ВТ_ОбъемНачислений_ТН.Шкала КАК Шкала,
	               |	ВТ_ОбъемНачислений_ТН.Приоритет КАК Приоритет,
	               |	ВТ_ОбъемНачислений_ТЭ.ТарифТЭ КАК ТарифТЭ,
	               |	ВТ_ОбъемНачислений_ТН.ОбъемПоНормативу КАК ОбъемПоНормативу,
	               |	ВТ_ОбъемНачислений_ТН.ОбъемПоСреднему КАК ОбъемПоСреднему,
	               |	ВТ_ОбъемНачислений_ТН.ОбъемПоСПриборам КАК ОбъемПоСПриборам,
	               |	ВТ_ОбъемНачислений_ТЭ.ОбъемТЭ КАК ОбъемТЭ,
	               |	ВТ_ОбъемНачислений_ТН.ОбъемТН КАК ОбъемТН,
	               |	ВТ_ОбъемНачислений_ТН.ПриборУчета КАК ПриборУчета,
	               |	ВТ_ОбъемНачислений_ТН.НачальныеПоказания КАК НачальныеПоказания,
	               |	ВТ_ОбъемНачислений_ТН.КонечныеПоказания КАК КонечныеПоказания,
	               |	ВТ_ОбъемНачислений_ТН.КоличествоПрописанных КАК КоличествоПрописанных,
	               |	ВТ_ОбъемНачислений_ТН.ЗначениеПлощади КАК ЗначениеПлощади,
	               |	ВТ_ОбъемНачислений_ТН.НормаПотребления КАК НормаПотребления,
	               |	ВТ_ОбъемНачислений_ТН.Квартира КАК Квартира,
	               |	ВТ_ОбъемНачислений_ТН.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВТ_ОбъемНачислений_ТН.ТарифТН КАК ТарифТН,
	               |	ВТ_ОбъемНачислений_ТН.СуммаТН КАК СуммаТН,
	               |	ВТ_ОбъемНачислений_ТН.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	               |	ВТ_ОбъемНачислений_ТН.ОбъемУслуги КАК ОбъемУслуги,
	               |	ВТ_ОбъемНачислений_ТН.СуммаТН + ВТ_ОбъемНачислений_ТЭ.СуммаТЭ КАК Сумма
	               |ПОМЕСТИТЬ ВТ_ОбъемНачислений
	               |ИЗ
	               |	ВТ_ОбъемНачислений_ТН КАК ВТ_ОбъемНачислений_ТН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемНачислений_ТЭ КАК ВТ_ОбъемНачислений_ТЭ
	               |		ПО ВТ_ОбъемНачислений_ТН.Организация = ВТ_ОбъемНачислений_ТЭ.Организация
	               |			И ВТ_ОбъемНачислений_ТН.Район = ВТ_ОбъемНачислений_ТЭ.Район
	               |			И ВТ_ОбъемНачислений_ТН.МКД = ВТ_ОбъемНачислений_ТЭ.МКД
	               |			И ВТ_ОбъемНачислений_ТН.Абонент = ВТ_ОбъемНачислений_ТЭ.Абонент
	               |			И ВТ_ОбъемНачислений_ТН.ПриборУчета = ВТ_ОбъемНачислений_ТЭ.ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргОбъемНачисленийМКД.Организация КАК Организация,
	               |	энргОбъемНачисленийМКД.Район КАК Район,
	               |	энргОбъемНачисленийМКД.МКД КАК МКД,
	               |	энргОбъемНачисленийМКД.Шкала КАК Шкала,
	               |	СУММА(энргОбъемНачисленийМКД.ОбъемУслуги) КАК ОбъемУслуги
	               |ПОМЕСТИТЬ ВТ_ОбъемНачисленийМКД_ТН
	               |ИЗ
	               |	РегистрНакопления.энргОбъемНачисленийМКД КАК энргОбъемНачисленийМКД
	               |ГДЕ
	               |	энргОбъемНачисленийМКД.Услуга = &ГВС_ТН
	               |	И энргОбъемНачисленийМКД.ВидНачисления = &ВидНачисления
	               |	И энргОбъемНачисленийМКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И энргОбъемНачисленийМКД.СпособНачисления = &ПоПриборам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргОбъемНачисленийМКД.Организация,
	               |	энргОбъемНачисленийМКД.Район,
	               |	энргОбъемНачисленийМКД.МКД,
	               |	энргОбъемНачисленийМКД.Шкала
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	               |	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	               |	энргЗначенияНормативовПотребленияСрезПоследних.ТипНачисления КАК ТипНачисления,
	               |	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	               |	МАКСИМУМ(энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива) КАК ЗначениеНорматива
	               |ПОМЕСТИТЬ ВТ_НормативыПотребления
	               |ИЗ
	               |	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	               |			&НачалоПериода,
	               |			Организация = &Организация
	               |				И (Услуга = &ГВС_ТН
	               |					ИЛИ Услуга = &ГВС_ТЭ)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргЗначенияНормативовПотребленияСрезПоследних.Организация,
	               |	энргЗначенияНормативовПотребленияСрезПоследних.Район,
	               |	энргЗначенияНормативовПотребленияСрезПоследних.ТипНачисления,
	               |	энргЗначенияНормативовПотребленияСрезПоследних.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Абонент,
	               |	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	               |	энргАбоненты.УдалитьКвартира КАК Квартира,
	               |	энргКоличествоПрописанныхСрезПоследних.Количество КАК КоличествоПрописанных,
	               |	энргЗначенияПлощадейСрезПоследних.Площадь КАК Площадь,
	               |	ВТ_ОбъемНачислений.МКД КАК МКД
	               |ПОМЕСТИТЬ ВТ_ДанныеПоАбонентам
	               |ИЗ
	               |	ВТ_ОбъемНачислений КАК ВТ_ОбъемНачислений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКоличествоПрописанных.СрезПоследних КАК энргКоличествоПрописанныхСрезПоследних
	               |			ПО (энргКоличествоПрописанныхСрезПоследних.УдалитьАбонент = энргАбоненты.Ссылка)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
	               |					&КонецПериода,
	               |					Организация = &Организация
	               |						И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь)) КАК энргЗначенияПлощадейСрезПоследних
	               |			ПО энргАбоненты.Ссылка = энргЗначенияПлощадейСрезПоследних.УдалитьАбонент
	               |		ПО ВТ_ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бестВладельцыОбъектовРасчетаСрезПоследних.ОбъектРасчета,
	               |	бестВладельцыОбъектовРасчетаСрезПоследних.Договор.Номер,
	               |	""нежилое"",
	               |	0,
	               |	бестЗначенияПлощадейНПСрезПоследних.Площадь,
	               |	ВТ_ОбъемНачислений.МКД
	               |ИЗ
	               |	ВТ_ОбъемНачислений КАК ВТ_ОбъемНачислений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестВладельцыОбъектовРасчета.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК бестВладельцыОбъектовРасчетаСрезПоследних
	               |		ПО ВТ_ОбъемНачислений.Организация = бестВладельцыОбъектовРасчетаСрезПоследних.Организация
	               |			И ВТ_ОбъемНачислений.Район = бестВладельцыОбъектовРасчетаСрезПоследних.Район
	               |			И ВТ_ОбъемНачислений.Абонент = бестВладельцыОбъектовРасчетаСрезПоследних.ОбъектРасчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЗначенияПлощадейНП.СрезПоследних(
	               |				&КонецПериода,
	               |				Организация = &Организация
	               |					И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП)) КАК бестЗначенияПлощадейНПСрезПоследних
	               |		ПО ВТ_ОбъемНачислений.Абонент = бестЗначенияПлощадейНПСрезПоследних.ОбъектРасчета
	               |			И ВТ_ОбъемНачислений.Организация = бестЗначенияПлощадейНПСрезПоследних.Организация
	               |			И ВТ_ОбъемНачислений.Район = бестЗначенияПлощадейНПСрезПоследних.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	энргАбоненты.Ссылка КАК Абонент,
	               |	энргЗначенияПлощадейСрезПоследних.Площадь КАК Площадь,
	               |	ВТ_ОбъемНачислений.МКД КАК МКД
	               |ПОМЕСТИТЬ ВТ_ДанныеПоПлощадямАбонентам
	               |ИЗ
	               |	ВТ_ОбъемНачислений КАК ВТ_ОбъемНачислений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
	               |					&КонецПериода,
	               |					Организация = &Организация
	               |						И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь)) КАК энргЗначенияПлощадейСрезПоследних
	               |			ПО энргАбоненты.Ссылка = энргЗначенияПлощадейСрезПоследних.УдалитьАбонент
	               |		ПО ВТ_ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ОбъемНачислений.Абонент,
	               |	бестЗначенияПлощадейНПСрезПоследних.Площадь,
	               |	ВТ_ОбъемНачислений.МКД
	               |ИЗ
	               |	ВТ_ОбъемНачислений КАК ВТ_ОбъемНачислений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЗначенияПлощадейНП.СрезПоследних(
	               |				&КонецПериода,
	               |				Организация = &Организация
	               |					И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП)) КАК бестЗначенияПлощадейНПСрезПоследних
	               |		ПО ВТ_ОбъемНачислений.Абонент = бестЗначенияПлощадейНПСрезПоследних.ОбъектРасчета
	               |			И ВТ_ОбъемНачислений.Организация = бестЗначенияПлощадейНПСрезПоследних.Организация
	               |			И ВТ_ОбъемНачислений.Район = бестЗначенияПлощадейНПСрезПоследних.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПоПлощадямАбонентам.МКД КАК МКД,
	               |	СУММА(ВТ_ДанныеПоПлощадямАбонентам.Площадь) КАК Площадь
	               |ПОМЕСТИТЬ ВТ_ПлощадьПомещенийМКД
	               |ИЗ
	               |	ВТ_ДанныеПоПлощадямАбонентам КАК ВТ_ДанныеПоПлощадямАбонентам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеПоПлощадямАбонентам.МКД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ОбъемНачислений.МКД КАК МКД,
	               |	ВТ_ОбъемНачислений.Приоритет КАК Приоритет,
	               |	ВТ_ОбъемНачислений.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВТ_ОбъемНачислений.Квартира КАК Квартира,
	               |	ВТ_ОбъемНачислений.Абонент КАК Абонент,
	               |	ВТ_ОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	               |	ВТ_ОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПлощадьПомещенийМКД.Площадь ЕСТЬ NULL
	               |				ИЛИ ВТ_ПлощадьПомещенийМКД.Площадь = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫРАЗИТЬ(ВТ_МКД.ПлощадьМКД / ВТ_ПлощадьПомещенийМКД.Площадь * ВТ_ДанныеПоАбонентам.Площадь КАК ЧИСЛО(15, 2))
	               |	КОНЕЦ КАК ПлощадьОбщегоИмуществаНаЛС,
	               |	ВТ_ОбъемНачислений.НормаПотребления КАК НормаПотребления,
	               |	ВТ_НормативыПотребленияОДН.ЗначениеНорматива КАК НормативОДН,
	               |	ВТ_ОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	               |	ВТ_ОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	               |	ВТ_ОбъемНачислений.ОбъемПоСПриборам КАК ОбъемПоСПриборам,
	               |	ВТ_ОбъемНачислений.ОбъемПоНормативу КАК ОбъемПоНормативу,
	               |	ВТ_ОбъемНачислений.ОбъемПоСреднему КАК ОбъемПоСреднему,
	               |	ВТ_ОбъемНачислений.ОбъемТН КАК ОбъемТН,
	               |	ВТ_ОбъемНачислений.ТарифТН КАК ТарифТН,
	               |	ВТ_ОбъемНачислений.СуммаТН КАК СуммаТН,
	               |	ВТ_ОбъемНачислений.ОбъемТЭ КАК ОбъемТЭ,
	               |	ВТ_ОбъемНачислений.ТарифТЭ КАК ТарифТЭ,
	               |	ВТ_ОбъемНачислений.СуммаТЭ КАК СуммаТЭ,
	               |	ВТ_ОбъемНачисленийМКД_ТН.ОбъемУслуги КАК ОбъемУслугиМКД,
	               |	ВТ_ОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	               |	ВТ_ОбъемНачислений.ОбъемУслуги КАК ОбъемУслугиСПовышающим,
	               |	ВТ_ОбъемНачислений.Сумма КАК СуммаСПовышающим,
	               |	ВТ_МКД.УК КАК УК,
	               |	ВТ_МКД.МКДУлица КАК МКДУлица,
	               |	(ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОбъемНачислений.СуммаТН, 0) / ВТ_ОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 4))) + (ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОбъемНачислений.СуммаТЭ, 0) КАК ЧИСЛО(15, 4))) КАК СуммаИтого,
	               |	(ВЫРАЗИТЬ(ВТ_ОбъемНачислений.Сумма КАК ЧИСЛО(15, 4))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОбъемНачислений.СуммаТН, 0) / ВТ_ОбъемНачислений.ПовыщающийКоэффициент КАК ЧИСЛО(15, 4))) - (ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОбъемНачислений.СуммаТЭ, 0) КАК ЧИСЛО(15, 4))) КАК НачисленоПоПовышающему,
	               |	ЕСТЬNULL(ВТ_ОбъемНачисленийМКД_ТН.ОбъемУслуги, 0) - ЕСТЬNULL(ВТ_ОбъемНачислений.ОбъемТН, 0) КАК ОДН
	               |ИЗ
	               |	ВТ_МКД КАК ВТ_МКД
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбъемНачислений КАК ВТ_ОбъемНачислений
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НормативыПотребления КАК ВТ_НормативыПотребленияОДН
	               |			ПО ВТ_ОбъемНачислений.Организация = ВТ_НормативыПотребленияОДН.Организация
	               |				И ВТ_ОбъемНачислений.Район = ВТ_НормативыПотребленияОДН.Район
	               |				И (ВТ_НормативыПотребленияОДН.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления))
	               |				И (ВТ_НормативыПотребленияОДН.Услуга = &ГВС_ТЭ)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеПоАбонентам КАК ВТ_ДанныеПоАбонентам
	               |			ПО ВТ_ОбъемНачислений.Абонент = ВТ_ДанныеПоАбонентам.Абонент
	               |		ПО ВТ_МКД.Организация = ВТ_ОбъемНачислений.Организация
	               |			И ВТ_МКД.МКД = ВТ_ОбъемНачислений.МКД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадьПомещенийМКД КАК ВТ_ПлощадьПомещенийМКД
	               |		ПО ВТ_МКД.МКД = ВТ_ПлощадьПомещенийМКД.МКД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемНачисленийМКД_ТН КАК ВТ_ОбъемНачисленийМКД_ТН
	               |		ПО ВТ_МКД.МКД = ВТ_ОбъемНачисленийМКД_ТН.МКД
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УК,
	               |	МКДУлица,
	               |	Приоритет
	               |ИТОГИ
	               |	СУММА(КоличествоПрописанных),
	               |	СУММА(ЗначениеПлощади),
	               |	СУММА(ПлощадьОбщегоИмуществаНаЛС),
	               |	СУММА(ОбъемПоСПриборам),
	               |	СУММА(ОбъемПоНормативу),
	               |	СУММА(ОбъемПоСреднему),
	               |	СУММА(ОбъемТН),
	               |	СУММА(СуммаТН),
	               |	СУММА(ОбъемТЭ),
	               |	СУММА(СуммаТЭ),
	               |	СУММА(ОбъемУслугиМКД),
	               |	СУММА(ОбъемУслугиСПовышающим),
	               |	СУММА(СуммаСПовышающим),
	               |	СУММА(СуммаИтого),
	               |	СУММА(НачисленоПоПовышающему),
	               |	СУММА(ОДН)
	               |ПО
	               |	ОБЩИЕ,
	               |	УК,
	               |	МКДУлица,
	               |	Приоритет,
	               |	Абонент";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ВыборкаУК = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
		ТекСтр = 9;
		
		Пока ВыборкаУК.Следующий() Цикл
			
			ОбластьУК.Параметры.УК = ВыборкаУК.УК;
			ТабДок.Вывести(ОбластьУК);
			
			ТекСтр = ТекСтр + 1;
			
			ВыборкаМКД = ВыборкаУК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаМКД.Следующий() Цикл
				
				ОбластьМКД.Параметры.МКДУлица = ВыборкаМКД.МКДУлица;
				ТабДок.Вывести(ОбластьМКД);
				
				ТекСтр = ТекСтр + 1;
				
				НомерСтроки = 1; 
				
				ВыборкаАбонент =  ВыборкаМКД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Абонент");
				
				Пока ВыборкаАбонент.Следующий() Цикл
					
					ВыборкаДетали = ВыборкаАбонент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
					
					ПерваяСтр = Истина;
					
					Пока ВыборкаДетали.Следующий() Цикл
						
						ОбластьДетали.Параметры.НомерСтроки = НомерСтроки;
						ОбластьДетали.Параметры.Заполнить(ВыборкаДетали);
						ТабДок.Вывести(ОбластьДетали);
					КонецЦикла;
					
					//Если ВыборкаДетали.Количество() > 1 Тогда
					//	
					//	Для Сч = 1 По 25 Цикл
					//		
					//		Если Сч <> 11 И Сч <> 12 И Сч <> 13 Тогда
					//			Область = ТабДок.Область(ТекСтр+1,Сч,ТекСтр+ВыборкаДетали.Количество()+1,Сч);
					//			
					//			Если Сч = 14 Тогда
					//				Область.Текст = ВыборкаАбонент.ОбъемПоНормативу;
					//			КонецЕсли;
					//			
					//			Если Сч = 15 Тогда
					//				Область.Текст = ВыборкаАбонент.ОбъемПоСреднему;
					//			КонецЕсли;
					//			
					//			Если Сч = 16 Тогда
					//				Область.Текст = ВыборкаАбонент.ОбъемТН;
					//			КонецЕсли;
					//			
					//			Если Сч = 17 Тогда
					//				Область.Текст = ВыборкаАбонент.СуммаТН;
					//			КонецЕсли;
					//			
					//			Область.Объединить();
					//		КонецЕсли;
					//		
					//	КонецЦикла;
					//КонецЕсли;
					
					ТекСтр = ТекСтр + ВыборкаДетали.Количество();
					
					НомерСтроки = НомерСтроки + 1;
					
					
				КонецЦикла;
				
				ОбластьИтогоМКД.Параметры.МКДУлица = ВыборкаМКД.МКДУлица;
				ОбластьИтогоМКД.Параметры.Заполнить(ВыборкаМКД);
				ТабДок.Вывести(ОбластьИтогоМКД);
				
				ТекСтр = ТекСтр + 1;
				
				ВыборкаПомещение = ВыборкаМКД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Приоритет");
				
				Если ВыборкаПомещение.Количество() > 1 Тогда
					
					Пока ВыборкаПомещение.Следующий() Цикл
						Если ВыборкаПомещение.Приоритет = 1 Тогда
							ОбластьИтогоМКДЖилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоМКДЖилые);
							ТекСтр = ТекСтр + 1;
						Иначе
							ОбластьИтогоМКДНежилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоМКДНежилые);
							ТекСтр = ТекСтр + 1;
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					Если ВыборкаПомещение.Следующий() Тогда
						Если ВыборкаПомещение.Приоритет = 1 Тогда
							ОбластьИтогоМКДЖилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоМКДЖилые);
							ТабДок.Вывести(ОбластьИтогоМКДНежилые);
							ТекСтр = ТекСтр + 2;
						ИначеЕсли ВыборкаПомещение.Приоритет = 2 Тогда
							ОбластьИтогоМКДНежилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоМКДЖилые);
							ТабДок.Вывести(ОбластьИтогоМКДНежилые);
							ТекСтр = ТекСтр + 2;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьИтогоУК.Параметры.Заполнить(ВыборкаУК);
			ТабДок.Вывести(ОбластьИтогоУК);
			
			ТекСтр = ТекСтр + 1;
			
			ВыборкаПомещение = ВыборкаУК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Приоритет");
						
			Если ВыборкаПомещение.Количество() > 1 Тогда
					
					Пока ВыборкаПомещение.Следующий() Цикл
						Если ВыборкаПомещение.Приоритет = 1 Тогда
							ОбластьИтогоУКЖилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоУКЖилые);
							ТекСтр = ТекСтр + 1;
						Иначе
							ОбластьИтогоУКНежилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоУКНежилые);
							ТекСтр = ТекСтр + 1;
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					Если ВыборкаПомещение.Следующий() Тогда
						Если ВыборкаПомещение.Приоритет = 1 Тогда
							ОбластьИтогоУКЖилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоУКЖилые);
							ТабДок.Вывести(ОбластьИтогоУКНежилые);
							ТекСтр = ТекСтр + 2;
						ИначеЕсли ВыборкаПомещение.Приоритет = 2 Тогда
							ОбластьИтогоУКНежилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоУКЖилые);
							ТабДок.Вывести(ОбластьИтогоУКНежилые);
							ТекСтр = ТекСтр + 2;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;

			
		КонецЦикла;
		
		ОбластьИтого.Параметры.Заполнить(ВыборкаИтоги);
		ТабДок.Вывести(ОбластьИтого);
		
		ВыборкаПомещение = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Приоритет");
		
		Если ВыборкаПомещение.Количество() > 1 Тогда
					
					Пока ВыборкаПомещение.Следующий() Цикл
						Если ВыборкаПомещение.Приоритет = 1 Тогда
							ОбластьИтогоЖилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоЖилые);
							ТекСтр = ТекСтр + 1;
						Иначе
							ОбластьИтогоНежилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоНежилые);
							ТекСтр = ТекСтр + 1;
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					Если ВыборкаПомещение.Следующий() Тогда
						Если ВыборкаПомещение.Приоритет = 1 Тогда
							ОбластьИтогоЖилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоЖилые);
							ТабДок.Вывести(ОбластьИтогоНежилые);
							ТекСтр = ТекСтр + 2;
						ИначеЕсли ВыборкаПомещение.Приоритет = 2 Тогда
							ОбластьИтогоНежилые.Параметры.Заполнить(ВыборкаПомещение);
							ТабДок.Вывести(ОбластьИтогоЖилые);
							ТабДок.Вывести(ОбластьИтогоНежилые);
							ТекСтр = ТекСтр + 2;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
